## Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
s = pd.Series([1,2,3,np.nan, 4,5])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [ ]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
data = ['w','x','y','j']
data

['w', 'x', 'y', 'j']

In [ ]:
list = [10,20,30,40]
list

[10, 20, 30, 40]

In [ ]:
arr = np.array([12,23,25,55])
arr

array([12, 23, 25, 55])

In [ ]:
arr.mean()

28.75

In [ ]:
dictionary = {'e':12, 'h':65,'j':75}
dictionary

{'e': 12, 'h': 65, 'j': 75}

In [ ]:
pd.Series(data = arr)

0    12
1    23
2    25
3    55
dtype: int64

In [ ]:
pd.Series(data = arr, index=data)

w    12
x    23
y    25
j    55
dtype: int64

In [ ]:
pd.Series(dictionary)

e    12
h    65
j    75
dtype: int64

In [ ]:
from numpy.random import randn

In [ ]:
np.random.seed(100)                                                        # Split() function is used to split the string into list of values
df = pd.DataFrame(randn(10,5), index= 'A B C D E F G H I J'.split(),columns = 'Score1 Score2 Score3 Score4 Score5'.split())
df

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
randn(10,5)

array([[-1.1880176 , -0.54974619, -0.94004616, -0.82793236,  0.10886347],
       [ 0.50780959, -0.86222735,  1.24946974, -0.07961125, -0.88973148],
       [-0.88179839,  0.01863895,  0.23784462,  0.01354855, -1.6355294 ],
       [-1.04420988,  0.61303888,  0.73620521,  1.02692144, -1.43219061],
       [-1.8411883 ,  0.36609323, -0.33177714, -0.68921798,  2.03460756],
       [-0.55071441,  0.75045333, -1.30699234,  0.58057334, -1.10452309],
       [ 0.69012147,  0.68689007, -1.56668753,  0.90497412,  0.7788224 ],
       [ 0.42823287,  0.10887199,  0.02828363, -0.57882582, -1.1994512 ],
       [-1.70595201,  0.36916396,  1.87657343, -0.37690335,  1.83193608],
       [ 0.00301743, -0.07602347,  0.00395759, -0.18501411, -2.48715154]])

In [ ]:
np.random.seed(100) # seed is used to lock the value and not to generate the random value every time runned
np.random.randint(0,100)

8

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
df[['Score4','Score3','Score1']]

     Score4    Score3    Score1
A -0.252436  1.153036 -1.749765
B -0.189496 -1.070043  0.514219
C  0.816847 -0.583595 -0.458027
D -0.438136  1.029733 -0.104411
E -0.842436 -0.251879  1.618982
F -0.326238  1.361556  0.937082
G  0.816454 -0.756352  0.222400
H -1.356399 -1.690617 -0.455947
I -0.612939  0.007315 -0.544439
J -1.613579  0.357508 -1.733096

In [ ]:
type(df['Score4'])

pandas.core.series.Series

## Adding new column to dataframe

In [ ]:
df['Score6'] = df['Score3'] + df['Score4']

In [ ]:
df['Score6']

A    0.900600
B   -1.259539
C    0.233252
D    0.591597
E   -1.094315
F    1.035318
G    0.060102
H   -3.047016
I   -0.605624
J   -1.256071
Name: Score6, dtype: float64

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5    Score6
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.900600
B  0.514219  0.221180 -1.070043 -0.189496  0.255001 -1.259539
C -0.458027  0.435163 -0.583595  0.816847  0.672721  0.233252
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318  0.591597
E  1.618982  1.541605 -0.251879 -0.842436  0.184519 -1.094315
F  0.937082  0.731000  1.361556 -0.326238  0.055676  1.035318
G  0.222400 -1.443217 -0.756352  0.816454  0.750445  0.060102
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435 -3.047016
I -0.544439 -0.668172  0.007315 -0.612939  1.299748 -0.605624
J -1.733096 -0.983310  0.357508 -1.613579  1.470714 -1.256071

In [ ]:
df.drop('Score6', axis=1 )  # The parameter axis=1 refer to columns

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5    Score6
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.900600
B  0.514219  0.221180 -1.070043 -0.189496  0.255001 -1.259539
C -0.458027  0.435163 -0.583595  0.816847  0.672721  0.233252
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318  0.591597
E  1.618982  1.541605 -0.251879 -0.842436  0.184519 -1.094315
F  0.937082  0.731000  1.361556 -0.326238  0.055676  1.035318
G  0.222400 -1.443217 -0.756352  0.816454  0.750445  0.060102
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435 -3.047016
I -0.544439 -0.668172  0.007315 -0.612939  1.299748 -0.605624
J -1.733096 -0.983310  0.357508 -1.613579  1.470714 -1.256071

##### The column doesn't gets deleted until we use inplace = True
Inplace is an argument used in different functions. Some functions in which inplace is used as an attributes like, set_index(), dropna(), fillna(), reset_index(), drop(), replace() and many more. The default value of this attribute is False and it returns the copy of the object.

In [ ]:
df.drop('Score6', axis=1, inplace = True )

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
df.drop('A', axis=0, inplace = True )

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
df.Score1   #  (or) df['Score1']

B    0.514219
C   -0.458027
D   -0.104411
E    1.618982
F    0.937082
G    0.222400
H   -0.455947
I   -0.544439
J   -1.733096
Name: Score1, dtype: float64

In [ ]:
df.loc['F']     # loc is used to access rows as a series

Score1    0.937082
Score2    0.731000
Score3    1.361556
Score4   -0.326238
Score5    0.055676
Name: F, dtype: float64

In [ ]:
df.iloc[8]            # iloc is used to access rows as a series using index as a location

Score1   -1.733096
Score2   -0.983310
Score3    0.357508
Score4   -1.613579
Score5    1.470714
Name: J, dtype: float64

In [ ]:
df.loc['F', 'Score2']          # selecting subset of rows and columns using loc

0.7310003438348087

In [ ]:
df.loc[['F','D'] , ['Score2', 'Score5']]

    Score2    Score5
F  0.73100  0.055676
D -0.53128 -1.118318

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676
G  0.222400 -1.443217 -0.756352  0.816454  0.750445
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
I -0.544439 -0.668172  0.007315 -0.612939  1.299748
J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
df>0.5

   Score1  Score2  Score3  Score4  Score5
B    True   False   False   False   False
C   False   False   False    True    True
D   False   False    True   False   False
E    True    True   False   False   False
F    True    True    True   False   False
G   False   False   False    True    True
H   False    True   False   False   False
I   False   False   False   False    True
J   False   False   False   False    True

In [ ]:
df[df>0.5]

     Score1    Score2    Score3    Score4    Score5
B  0.514219       NaN       NaN       NaN       NaN
C       NaN       NaN       NaN  0.816847  0.672721
D       NaN       NaN  1.029733       NaN       NaN
E  1.618982  1.541605       NaN       NaN       NaN
F  0.937082  0.731000  1.361556       NaN       NaN
G       NaN       NaN       NaN  0.816454  0.750445
H       NaN  1.189622       NaN       NaN       NaN
I       NaN       NaN       NaN       NaN  1.299748
J       NaN       NaN       NaN       NaN  1.470714

In [ ]:
df[df.Score1 > 0.5]

     Score1    Score2    Score3    Score4    Score5
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
E  1.618982  1.541605 -0.251879 -0.842436  0.184519
F  0.937082  0.731000  1.361556 -0.326238  0.055676

In [ ]:
df[df.Score1 > 0.5]['Score2']

B    0.221180
E    1.541605
F    0.731000
Name: Score2, dtype: float64

In [ ]:
df.reset_index()

  index    Score1    Score2    Score3    Score4    Score5
0     B  0.514219  0.221180 -1.070043 -0.189496  0.255001
1     C -0.458027  0.435163 -0.583595  0.816847  0.672721
2     D -0.104411 -0.531280  1.029733 -0.438136 -1.118318
3     E  1.618982  1.541605 -0.251879 -0.842436  0.184519
4     F  0.937082  0.731000  1.361556 -0.326238  0.055676
5     G  0.222400 -1.443217 -0.756352  0.816454  0.750445
6     H -0.455947  1.189622 -1.690617 -1.356399 -1.232435
7     I -0.544439 -0.668172  0.007315 -0.612939  1.299748
8     J -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
# setting the new index

newindex = 'bn mn kk jh mh gh hn jh jf'.split()
newindex

['bn', 'mn', 'kk', 'jh', 'mh', 'gh', 'hn', 'jh', 'jf']

In [ ]:
df['Countries'] = newindex

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5 Countries
B  0.514219  0.221180 -1.070043 -0.189496  0.255001        bn
C -0.458027  0.435163 -0.583595  0.816847  0.672721        mn
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318        kk
E  1.618982  1.541605 -0.251879 -0.842436  0.184519        jh
F  0.937082  0.731000  1.361556 -0.326238  0.055676        mh
G  0.222400 -1.443217 -0.756352  0.816454  0.750445        gh
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435        hn
I -0.544439 -0.668172  0.007315 -0.612939  1.299748        jh
J -1.733096 -0.983310  0.357508 -1.613579  1.470714        jf

In [ ]:
df.set_index('Countries')

             Score1    Score2    Score3    Score4    Score5
Countries
bn         0.514219  0.221180 -1.070043 -0.189496  0.255001
mn        -0.458027  0.435163 -0.583595  0.816847  0.672721
kk        -0.104411 -0.531280  1.029733 -0.438136 -1.118318
jh         1.618982  1.541605 -0.251879 -0.842436  0.184519
mh         0.937082  0.731000  1.361556 -0.326238  0.055676
gh         0.222400 -1.443217 -0.756352  0.816454  0.750445
hn        -0.455947  1.189622 -1.690617 -1.356399 -1.232435
jh        -0.544439 -0.668172  0.007315 -0.612939  1.299748
jf        -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [ ]:
df

     Score1    Score2    Score3    Score4    Score5 Countries
B  0.514219  0.221180 -1.070043 -0.189496  0.255001        bn
C -0.458027  0.435163 -0.583595  0.816847  0.672721        mn
D -0.104411 -0.531280  1.029733 -0.438136 -1.118318        kk
E  1.618982  1.541605 -0.251879 -0.842436  0.184519        jh
F  0.937082  0.731000  1.361556 -0.326238  0.055676        mh
G  0.222400 -1.443217 -0.756352  0.816454  0.750445        gh
H -0.455947  1.189622 -1.690617 -1.356399 -1.232435        hn
I -0.544439 -0.668172  0.007315 -0.612939  1.299748        jh
J -1.733096 -0.983310  0.357508 -1.613579  1.470714        jf

In [ ]:
df.set_index('Countries', inplace = True)

In [ ]:
df

             Score1    Score2    Score3    Score4    Score5
Countries
bn         0.514219  0.221180 -1.070043 -0.189496  0.255001
mn        -0.458027  0.435163 -0.583595  0.816847  0.672721
kk        -0.104411 -0.531280  1.029733 -0.438136 -1.118318
jh         1.618982  1.541605 -0.251879 -0.842436  0.184519
mh         0.937082  0.731000  1.361556 -0.326238  0.055676
gh         0.222400 -1.443217 -0.756352  0.816454  0.750445
hn        -0.455947  1.189622 -1.690617 -1.356399 -1.232435
jh        -0.544439 -0.668172  0.007315 -0.612939  1.299748
jf        -1.733096 -0.983310  0.357508 -1.613579  1.470714

## Methods to deal with missed data

In [ ]:
df = pd.DataFrame({'Basket': [1,2,np.nan,3,5,8,np.nan],
                   'volley': [1,6,np.nan,np.nan,6,8,7],
                   'carrom': [2,3,np.nan,np.nan,np.nan,5,6],
                   'barrom': [2,3,4,5,6,7,8]})

In [ ]:
df

   Basket  volley  carrom  barrom
0     1.0     1.0     2.0       2
1     2.0     6.0     3.0       3
2     NaN     NaN     NaN       4
3     3.0     NaN     NaN       5
4     5.0     6.0     NaN       6
5     8.0     8.0     5.0       7
6     NaN     7.0     6.0       8

In [ ]:
df.dropna(axis = 0)

   Basket  volley  carrom  barrom
0     1.0     1.0     2.0       2
1     2.0     6.0     3.0       3
5     8.0     8.0     5.0       7

In [ ]:
df.dropna(axis = 1)

   barrom
0       2
1       3
2       4
3       5
4       6
5       7
6       8

In [ ]:
df.dropna(thresh=2)

   Basket  volley  carrom  barrom
0     1.0     1.0     2.0       2
1     2.0     6.0     3.0       3
3     3.0     NaN     NaN       5
4     5.0     6.0     NaN       6
5     8.0     8.0     5.0       7
6     NaN     7.0     6.0       8

In [ ]:
df.fillna(value=0)

   Basket  volley  carrom  barrom
0     1.0     1.0     2.0       2
1     2.0     6.0     3.0       3
2     0.0     0.0     0.0       4
3     3.0     0.0     0.0       5
4     5.0     6.0     0.0       6
5     8.0     8.0     5.0       7
6     0.0     7.0     6.0       8

In [ ]:
df["carrom"].fillna(value = df["carrom"].mean())

0    2.0
1    3.0
2    4.0
3    4.0
4    4.0
5    5.0
6    6.0
Name: carrom, dtype: float64

In [ ]:
df

   Basket  volley  carrom  barrom
0     1.0     1.0     2.0       2
1     2.0     6.0     3.0       3
2     NaN     NaN     NaN       4
3     3.0     NaN     NaN       5
4     5.0     6.0     NaN       6
5     8.0     8.0     5.0       7
6     NaN     7.0     6.0       8

## Group By
-- used to group rows together and perform aggregate fuctions

In [ ]:
df = pd.DataFrame({'cust_id': [1001,1001,1003,1003,1005,1005],
                   'name': ['vijay','suman','lavanya', 'gou','shek','harsha'],
                   'salary': [200000,35000,50000,60000,15000,25000]})

In [ ]:
df

   cust_id     name  salary
0     1001    vijay  200000
1     1001    suman   35000
2     1003  lavanya   50000
3     1003      gou   60000
4     1005     shek   15000
5     1005   harsha   25000

In [ ]:
df.groupby('cust_id')

In [ ]:
custid_grouped = df.groupby('cust_id')
custid_grouped

In [ ]:
custid_grouped.mean()

         salary
cust_id
1001     117500
1003      55000
1005      20000

In [ ]:
custid_grouped.std()

                salary
cust_id
1001     116672.618896
1003       7071.067812
1005       7071.067812

In [ ]:
custid_grouped.min()

           name  salary
cust_id
1001      suman   35000
1003        gou   50000
1005     harsha   15000

In [ ]:
custid_grouped.max()

            name  salary
cust_id
1001       vijay  200000
1003     lavanya   60000
1005        shek   25000

In [ ]:
custid_grouped.count()

         name  salary
cust_id
1001        2       2
1003        2       2
1005        2       2

In [ ]:
custid_grouped.describe()

        salary                           ...
         count      mean            std  ...       50%       75%       max
cust_id                                  ...
1001       2.0  117500.0  116672.618896  ...  117500.0  158750.0  200000.0
1003       2.0   55000.0    7071.067812  ...   55000.0   57500.0   60000.0
1005       2.0   20000.0    7071.067812  ...   20000.0   22500.0   25000.0

[3 rows x 8 columns]

In [ ]:
custid_grouped.describe().transpose()  # or T

cust_id                1001          1003          1005
salary count       2.000000      2.000000      2.000000
       mean   117500.000000  55000.000000  20000.000000
       std    116672.618896   7071.067812   7071.067812
       min     35000.000000  50000.000000  15000.000000
       25%     76250.000000  52500.000000  17500.000000
       50%    117500.000000  55000.000000  20000.000000
       75%    158750.000000  57500.000000  22500.000000
       max    200000.000000  60000.000000  25000.000000

In [ ]:
custid_grouped.describe().T[1001]

salary  count         2.000000
        mean     117500.000000
        std      116672.618896
        min       35000.000000
        25%       76250.000000
        50%      117500.000000
        75%      158750.000000
        max      200000.000000
Name: 1001, dtype: float64

In [ ]:
df1 = pd.DataFrame({'cust_id': [1001,1002,1003,],
                   'name': ['vijay','suman','lavanya', ],
                   'salary': [200000,35000,50000]})

In [ ]:
df1

   cust_id     name  salary
0     1001    vijay  200000
1     1002    suman   35000
2     1003  lavanya   50000

In [ ]:
df2 = pd.DataFrame({'emp_id': [2001,2002,2003],
                   'emp_name': ['gou','shek','harsha'],
                   'salary': [60000,15000,25000]})
df2

   emp_id emp_name  salary
0    2001      gou   60000
1    2002     shek   15000
2    2003   harsha   25000

In [ ]:
df3 = pd.DataFrame({'cust_id': [1007,1008,1009],
                   'name': [ 'gouthami','shekar','viharsh'],
                   'bonus': [20000,15000,25000]})

In [ ]:
df3

   cust_id      name  bonus
0     1007  gouthami  20000
1     1008    shekar  15000
2     1009   viharsh  25000

## Contatenation
joins dataframes basically either rows or columns(axis = 0 or 1)
,we need to ensure dimension size of dataframes is same

In [ ]:
pd.concat([df1,df2,df3])

   cust_id      name    salary  emp_id emp_name    bonus
0   1001.0     vijay  200000.0     NaN      NaN      NaN
1   1002.0     suman   35000.0     NaN      NaN      NaN
2   1003.0   lavanya   50000.0     NaN      NaN      NaN
0      NaN       NaN   60000.0  2001.0      gou      NaN
1      NaN       NaN   15000.0  2002.0     shek      NaN
2      NaN       NaN   25000.0  2003.0   harsha      NaN
0   1007.0  gouthami       NaN     NaN      NaN  20000.0
1   1008.0    shekar       NaN     NaN      NaN  15000.0
2   1009.0   viharsh       NaN     NaN      NaN  25000.0

In [ ]:
pd.concat([df1,df2,df3],axis = 1)

   cust_id     name  salary  emp_id emp_name  salary  cust_id      name  bonus
0     1001    vijay  200000    2001      gou   60000     1007  gouthami  20000
1     1002    suman   35000    2002     shek   15000     1008    shekar  15000
2     1003  lavanya   50000    2003   harsha   25000     1009   viharsh  25000

 ## Merging 
Just like sql tables, used to merge dataframes

In [ ]:
Table1 = pd.DataFrame({'cust_id': [1000, 1001,1002, 1003],
                       'Q1': ['15000','1250','15020','2123'],
                       'Q2':['1532','4646','6545','5464']})

In [ ]:
Table1

   cust_id     Q1    Q2
0     1000  15000  1532
1     1001   1250  4646
2     1002  15020  6545
3     1003   2123  5464

In [ ]:
Table2 = pd.DataFrame({'cust_id': [1002, 1005,1004, 1003],
                       'Q3': ['25000','1250','5050','1123'],
                       'Q4':['1232','2646','6544','2464']})

In [ ]:
Table2

   cust_id     Q3    Q4
0     1002  25000  1232
1     1005   1250  2646
2     1004   5050  6544
3     1003   1123  2464

In [ ]:
pd.merge(Table1,Table2, how= 'outer',on = 'cust_id')

   cust_id     Q1    Q2     Q3    Q4
0     1000  15000  1532    NaN   NaN
1     1001   1250  4646    NaN   NaN
2     1002  15020  6545  25000  1232
3     1003   2123  5464   1123  2464
4     1005    NaN   NaN   1250  2646
5     1004    NaN   NaN   5050  6544

In [ ]:
pd.merge(Table1,Table2, how= 'inner',on = 'cust_id')

   cust_id     Q1    Q2     Q3    Q4
0     1002  15020  6545  25000  1232
1     1003   2123  5464   1123  2464

In [ ]:
Table1 = pd.DataFrame({'Q1': ['15000','1250','15020','2123'],
                       'Q2':['1532','4646','6545','5464']},
                       index = ['0', '1', '2', '3'])
Table2 = pd.DataFrame({'Q3': ['25000','1250','5050','1123'],
                       'Q4':['1232','2646','6544','2464']},
                      index = ['0', '2', '3', '4'])

In [ ]:
Table1.join(Table2)       # Left Join

      Q1    Q2     Q3    Q4
0  15000  1532  25000  1232
1   1250  4646    NaN   NaN
2  15020  6545   1250  2646
3   2123  5464   5050  6544

In [ ]:
Table1.join(Table2,how = 'outer')

      Q1    Q2     Q3    Q4
0  15000  1532  25000  1232
1   1250  4646    NaN   NaN
2  15020  6545   1250  2646
3   2123  5464   5050  6544
4    NaN   NaN   1123  2464

In [ ]:
Table1.join(Table2,how = 'inner')

      Q1    Q2     Q3    Q4
0  15000  1532  25000  1232
2  15020  6545   1250  2646
3   2123  5464   5050  6544